## Plan changes
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 4 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.covidshield_key_retrieval_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "covidshield_key_retrieval_task"  {
      ~ id       = "bfef57506e377a3f1357a87f171509ecbf099be42bc94931e8c71133f61ceed2" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "ENV"
                          - value = "staging"
                        },
                      - {
                          - name  = "METRICS_USERNAME"
                          - value = "z8oP0NRnbJ8P1frPGQrd"
                        },
                    ]
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-retrieval"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeyRetrieval"
                        }
                    }
                  - name             = "key-retrieval"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ"
                        },
                      - {
                          - name      = "RETRIEVE_HMAC_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-hmac-key-0r6pob-oGGsIt"
                        },
                      - {
                          - name      = "ECDSA_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-ecdsa-key-0r6pob-Dbo4Qd"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-read-only-url-0r6pob-vGtwqR"
                        },
                      - {
                          - name      = "METRICS_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-metric-password-0r6pob-3e5ppZ"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.template_file.covidshield_key_submission_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "covidshield_key_submission_task"  {
      ~ id       = "7e5c7c8ced1906b3a2a03de7091a2d6f295497ab50441e8d87e8dfc46afe4f6c" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "ENV"
                          - value = "staging"
                        },
                      - {
                          - name  = "ENABLE_TEST_TOOLS"
                          - value = "true"
                        },
                    ]
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-submission"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeySubmission"
                        }
                    }
                  - name             = "key-submission"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-url-0r6pob-fA6Kbq"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_ecs_cluster.covidshield will be updated in-place
  ~ resource "aws_ecs_cluster" "covidshield" {
        id                 = "arn:aws:ecs:ca-central-1:005133826942:cluster/CovidShield"
        name               = "CovidShield"
        tags               = {
            "CostCentre" = "CovidShield"
        }
        # (3 unchanged attributes hidden)

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_task_definition.covidshield_key_retrieval must be replaced
-/+ resource "aws_ecs_task_definition" "covidshield_key_retrieval" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/KeyRetrieval:282" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "ENV"
                          - value = "staging"
                        },
                      - {
                          - name  = "METRICS_USERNAME"
                          - value = "z8oP0NRnbJ8P1frPGQrd"
                        },
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-retrieval"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeyRetrieval"
                        }
                    }
                  - mountPoints      = []
                  - name             = "key-retrieval"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                          - hostPort      = 8001
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ"
                        },
                      - {
                          - name      = "RETRIEVE_HMAC_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-hmac-key-0r6pob-oGGsIt"
                        },
                      - {
                          - name      = "ECDSA_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-ecdsa-key-0r6pob-Dbo4Qd"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-read-only-url-0r6pob-vGtwqR"
                        },
                      - {
                          - name      = "METRICS_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-metric-password-0r6pob-3e5ppZ"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "KeyRetrieval" -> (known after apply)
      ~ revision                 = 282 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.covidshield_key_submission must be replaced
-/+ resource "aws_ecs_task_definition" "covidshield_key_submission" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/KeySubmission:279" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "ENABLE_TEST_TOOLS"
                          - value = "true"
                        },
                      - {
                          - name  = "ENV"
                          - value = "staging"
                        },
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-submission"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeySubmission"
                        }
                    }
                  - mountPoints      = []
                  - name             = "key-submission"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                          - hostPort      = 8000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-url-0r6pob-fA6Kbq"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "KeySubmission" -> (known after apply)
      ~ revision                 = 279 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.covidshield_secrets_manager_key_retrieval will be updated in-place
  ~ resource "aws_iam_policy" "covidshield_secrets_manager_key_retrieval" {
        id        = "arn:aws:iam::005133826942:policy/CovidShieldSecretsManagerKeyRetrieval"
        name      = "CovidShieldSecretsManagerKeyRetrieval"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-url-0r6pob-fA6Kbq",
                          + "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-read-only-url-0r6pob-vGtwqR",
                            "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ",
                            # (3 unchanged elements hidden)
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.covidshield_database will be updated in-place
  ~ resource "aws_security_group" "covidshield_database" {
        id                     = "sg-06be84cecd0622042"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-01c8d2505904ab6c7",
                  - "sg-0dccc93503d5844ed",
                ]
              - self             = false
              - to_port          = 3306
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-05f8484d0adea8cf0",
                ]
              - self             = false
              - to_port          = 3306
            },
          + {
              + cidr_blocks      = []
              + description      = null
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-01c8d2505904ab6c7",
                  + "sg-0dccc93503d5844ed",
                ]
              + self             = false
              + to_port          = 3306
            },
        ]
        name                   = "covidshield-database"
        tags                   = {
            "CostCentre" = "CovidShield"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_wafv2_web_acl.key_retrieval_cdn will be updated in-place
  ~ resource "aws_wafv2_web_acl" "key_retrieval_cdn" {
        id         = "c70e4ca5-1d56-4909-9611-b994a42d22fa"
        name       = "key_retrieval_cdn"
        tags       = {
            "CostCentre" = "CovidShield"
        }
        # (5 unchanged attributes hidden)


      - rule {
          - name     = "KeyRetrievalRateLimit" -> null
          - priority = 0 -> null

          - action {

              - block {
                }
            }

          - statement {

              - rate_based_statement {
                  - aggregate_key_type = "IP" -> null
                  - limit              = 10000 -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "KeyRetrievalRateLimit" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "KeyRetrievalRateLimit"
          + priority = 101

          + action {

              + block {
                }
            }

          + statement {

              + rate_based_statement {
                  + aggregate_key_type = "IP"
                  + limit              = 10000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "KeyRetrievalRateLimit"
              + sampled_requests_enabled   = true
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>